app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :text))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = 3  [["text", "Testdfhsfgndfhdghm"], ["updated_at", Thu, 20 Mar 2014 19:45:01 UTC +00:00]]